Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.IsEqual(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
Check if the contents of two instances of settings are equal.
other:
The settings to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Assign(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
Assigns values of the source settings to this object.
other:
The source settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018